package com.wyj.test.kafka.simple;

import java.util.HashSet;
import java.util.Set;

import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;

/**
 * @author wuyingjie <wuyingjie@kuaishou.com>
 * Created on 2020-02-04
 */
public class Test {
    public static void main(String[] args) {
        String str = "{\"result\":[{\"name\":\"北京快富安文化传播有限公司\",\"paytaxNumber\":\"91110108MA017XMT30\","
                + "\"phone\":\"010-53952609\",\"address\":\"北京市海淀区上地西路6号1幢1层 101D1-2\","
                + "\"branchBankName\":\"招商银行北京清华园支行\",\"account\":\"110930395110902\"},{\"name\":\"北京快手广告有限公司\","
                + "\"paytaxNumber\":\"91110108MA008E1A73\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101D1-1\",\"branchBankName\":\"招商银行北京清华园支行\","
                + "\"account\":\"110924641710701\"},{\"name\":\"北京达佳互联信息技术有限公司\","
                + "\"paytaxNumber\":\"911101083978285266\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101D1-7\",\"branchBankName\":\"招商银行北京清华园支行\","
                + "\"account\":\"110912578810601\"},{\"name\":\"深圳宁辉信息技术有限公司\","
                + "\"paytaxNumber\":\"91440300MA5EHYT256\",\"phone\":\"0755-86533783\","
                + "\"address\":\"深圳市南山区粤海街道滨海社区海天二路19号易思博软件大厦5层503室\",\"branchBankName\":\"招商银行深圳软件基地支行\","
                + "\"account\":\"755933911210301\"},{\"name\":\"北京华艺汇龙网络科技有限公司\","
                + "\"paytaxNumber\":\"91110108795105411R\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101D1-11\",\"branchBankName\":\"招商银行北京清华园支行\","
                + "\"account\":\"110922464510301\"},{\"name\":\"广州弹幕网络科技有限公司\","
                + "\"paytaxNumber\":\"914401013275880537\",\"phone\":\"010-53952609\","
                + "\"address\":\"广州市南沙区海滨路185号2514房之一（仅限办公）\",\"branchBankName\":\"招商银行股份有限公司广州分行营业部\","
                + "\"account\":\"120909191410301\"},{\"name\":\"广州爱稀饭网络科技有限公司\","
                + "\"paytaxNumber\":\"91440101304516014T\",\"phone\":\"010-53952609\","
                + "\"address\":\"广州市荔湾区黄沙大道155号北二区213号（仅限办公）\",\"branchBankName\":\"招商银行股份有限公司广州分行营业部\","
                + "\"account\":\"120908406710801\"},{\"name\":\"湘西快手技术服务有限公司\","
                + "\"paytaxNumber\":\"91433101MA4QU4QWXA\",\"phone\":\"010-53952609\","
                + "\"address\":\"湖南省湘西经开区武陵山大道18号金融中心8楼\",\"branchBankName\":\"中国建设银行股份有限公司湘西经开区支行\","
                + "\"account\":\"43050173643609123456\"},{\"name\":\"杭州亦晴科技有限公司\","
                + "\"paytaxNumber\":\"91330110MA2GMD06X2\",\"phone\":\"010-53952609\","
                + "\"address\":\"浙江省杭州市余杭区仓前街道时尚万通城2幢912E室\",\"branchBankName\":\"招商银行股份有限公司杭州高新支行\","
                + "\"account\":\"571913518410601\"},{\"name\":\"杭州欣霁广告有限公司\",\"paytaxNumber\":\"91330106MA2GL2DG98\","
                + "\"phone\":\"010-53952609\",\"address\":\"浙江省杭州市西湖区学院路28-38号1幢1号楼904-9室\","
                + "\"branchBankName\":\"招商银行杭州高新支行\",\"account\":\"571913281010701\"},{\"name\":\"北京赛瑞思动文化传播有限公司\","
                + "\"paytaxNumber\":\"91110108078515450U\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101 A1-3\",\"branchBankName\":\"中国民生银行北京中关村支行\","
                + "\"account\":\"601364514\"},{\"name\":\"江苏华福视频科技有限公司\",\"paytaxNumber\":\"91320211MA1NGAQMX6\","
                + "\"phone\":\"010-53952609\",\"address\":\"无锡市蠡湖大道2009号无锡国家数字电影产业园A9号201\","
                + "\"branchBankName\":\"招商银行无锡分行城西支行\",\"account\":\"510903710910301\"},{\"name\":\"成都遂意文化传播有限公司\","
                + "\"paytaxNumber\":\"91510100MA637X7112\",\"phone\":\"010-53952609\",\"address\":\"中国（四川)"
                + "自由贸易试验区成都高新区天府三街219号16层单元\",\"branchBankName\":\"招商银行成都天府大道支行\",\"account\":\"128909203910301\"},"
                + "{\"name\":\"上海欣星多媒体科技有限公司\",\"paytaxNumber\":\"91310115MA1K42EY12\",\"phone\":\"010-53952609\","
                + "\"address\":\"中国（上海）自由贸易试验区张杨路828-838号26楼\",\"branchBankName\":\"上海浦东发展银行股份有限公司北京北沙滩支行\","
                + "\"account\":\"91350078801100000378\"},{\"name\":\"北京达佳互联信息技术有限公司深圳分公司\","
                + "\"paytaxNumber\":\"91440300MA5FB37613\",\"phone\":\"010-53952609\","
                + "\"address\":\"深圳市南山区粤海街道新海宜易思博软件大厦5层503室\",\"branchBankName\":\"招商银行深圳软件基地支行\","
                + "\"account\":\"755940368610601\"},{\"name\":\"上海欣霁广告有限公司\",\"paytaxNumber\":\"91310114MA1GW6A16D\","
                + "\"phone\":\"010-53952609\",\"address\":\"上海市嘉定工业区叶城路925号B区4幢J3732室\","
                + "\"branchBankName\":\"招商银行上海东方支行\",\"account\":\"121933032910606\"},{\"name\":\"武汉快手多媒体技术有限公司\","
                + "\"paytaxNumber\":\"91420107MA4KXTHMXA\",\"phone\":\"010-53952609\","
                + "\"address\":\"武汉市青山区19街坊（和平大道1540号）钰龙时代中心17-26层1901-1907室\",\"branchBankName\":\"招商银行武汉青山支行\","
                + "\"account\":\"127911112210601\"},{\"name\":\"北京弹幕网络科技有限公司\","
                + "\"paytaxNumber\":\"91110105MA001BJU94\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101 A1-2\",\"branchBankName\":\"招商银行北京清华园支行\","
                + "\"account\":\"110936529610901\"},{\"name\":\"北京慕远科技有限公司\",\"paytaxNumber\":\"91110108MA00FC4H60\","
                + "\"phone\":\"010-53952609\",\"address\":\"北京市海淀区上地西路6号1幢1层101 D1-3\","
                + "\"branchBankName\":\"招商银行北京清华园支行\",\"account\":\"110928614110101\"},"
                + "{\"name\":\"北京达佳互联信息技术有限公司杭州分公司\",\"paytaxNumber\":\"91330108MA2CEKCY7R\","
                + "\"phone\":\"010-53952609\",\"address\":\"浙江省杭州市滨江区西兴街道江陵路88号3幢525室\","
                + "\"branchBankName\":\"招商银行杭州高新支行\",\"account\":\"571912623610902\"},{\"name\":\"北京一笑科技发展有限公司\","
                + "\"paytaxNumber\":\"91110114587686290Y\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101 D1-8\",\"branchBankName\":\"中国建设银行北京天通苑支行\","
                + "\"account\":\"11001029700059000239\"},{\"name\":\"淮安兴艺文化传播有限公司\","
                + "\"paytaxNumber\":\"91320829MA1Q0U4Y83\",\"phone\":\"010-53952609\","
                + "\"address\":\"淮安市洪泽区高良涧街道渤海北路3号A06\",\"branchBankName\":\"建设银行洪泽县支行\","
                + "\"account\":\"32050172793600000710\"},{\"name\":\"北京快手科技有限公司\","
                + "\"paytaxNumber\":\"91110108335469089C\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101 D1-10\",\"branchBankName\":\"招商银行北京清华园支行\","
                + "\"account\":\"110915440310802\"},{\"name\":\"北京瑞阁兴拍卖有限公司\","
                + "\"paytaxNumber\":\"91110108MA01EQ523E\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区厂洼街3号2号楼三层A3128\",\"branchBankName\":\"招商银行北京清华园支行\","
                + "\"account\":\"110935458610801\"},{\"name\":\"游艺星际（北京）科技有限公司\","
                + "\"paytaxNumber\":\"91110105795111539R\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101 A1-1\",\"branchBankName\":\"招商银行北京望京支行\","
                + "\"account\":\"110906440410103\"},{\"name\":\"武汉雨霁科技有限公司\",\"paytaxNumber\":\"91420111MA49AWU806\","
                + "\"phone\":\"010-53952609\",\"address\":\"洪山区李桥村文化大道555号融科智谷A1-84号\","
                + "\"branchBankName\":\"招商银行股份有限公司武汉青山支行\",\"account\":\"127913157010902\"},"
                + "{\"name\":\"淮安康祥福文化传播有限公司无锡分公司\",\"paytaxNumber\":\"91320211MA1T9F1L3A\","
                + "\"phone\":\"0517-89337066\",\"address\":\"无锡市蠡湖大道2009号\",\"branchBankName\":\"招商银行无锡城西支行\","
                + "\"account\":\"510903977110103\"},{\"name\":\"贵州省梵快文化传播有限公司哈尔滨分公司\","
                + "\"paytaxNumber\":\"91230103MA1BQWYJXE\",\"phone\":\"010-53952609\","
                + "\"address\":\"哈尔滨市南岗区中兴街145号5203栋2单元7层3号（住宅）\",\"branchBankName\":\"招商银行股份有限公司哈尔滨南岗支行\","
                + "\"account\":\"451905430710601\"},{\"name\":\"河北雄安快手科技有限公司\","
                + "\"paytaxNumber\":\"91130629MA0CGRW7X9 \",\"phone\":\"010-53952609\","
                + "\"address\":\"河北省保定市容城县城关镇西关村和平路春风巷2号 \",\"branchBankName\":\"建设银行荣城支行\","
                + "\"account\":\"13050166850800001100\"},{\"name\":\"广州欣星广告有限公司\","
                + "\"paytaxNumber\":\"91440101MA59U2MY1L\",\"phone\":\"010-53952609\","
                + "\"address\":\"广州市天河区华明路13号1903J房（仅限办公用途）\",\"branchBankName\":\"招商银行广州分行营业部\","
                + "\"account\":\"120913051010901\"},{\"name\":\"贵州省梵快文化传播有限公司\","
                + "\"paytaxNumber\":\"91520603MA6HK1XA7T\",\"phone\":\"010-53952609\","
                + "\"address\":\"贵州省铜仁市万山区产业园主楼B幢13层前排\",\"branchBankName\":\"中国建设银行股份有限公司铜仁万山区支行\","
                + "\"account\":\"52050110256700000758\"},{\"name\":\"贵州省梵心灵指信息技术有限公司\","
                + "\"paytaxNumber\":\"91520603MA6HK1XT2U\",\"phone\":\"010-53952609\","
                + "\"address\":\"贵州省铜仁市万山区产业园主楼B幢13层前排\",\"branchBankName\":\"中国建设银行股份有限公司铜仁万山区支行\","
                + "\"account\":\"52050110256700000757\"},{\"name\":\"天津汇龙文化传播有限公司\","
                + "\"paytaxNumber\":\"91120111MA06A17K81\",\"phone\":\"010-53952609\","
                + "\"address\":\"天津市西青区中北镇万卉路3号新城市中心写字楼B座19楼01号\",\"branchBankName\":\"招商银行天津滨海分行营业部\","
                + "\"account\":\"122908917410902\"},{\"name\":\"北京晨钟科技有限公司\",\"paytaxNumber\":\"91110108MA00FY7302\","
                + "\"phone\":\"010-53952609\",\"address\":\"北京市海淀区上地西路6号1幢1层101 D1-4\","
                + "\"branchBankName\":\"招商银行北京清华园支行\",\"account\":\"110928887710501\"},{\"name\":\"杭州游趣网络有限公司\","
                + "\"paytaxNumber\":\"913301066767695811\",\"phone\":\"\","
                + "\"address\":\"浙江省杭州市西湖区学院路28~38号1幢1号楼903-10室\",\"branchBankName\":\"招商银行杭州高新支行\","
                + "\"account\":\"571905630810303\"},{\"name\":\"北京快手科技有限公司南京分公司\","
                + "\"paytaxNumber\":\"91320113MA1Y3Y8J56\",\"phone\":\"010-53952609\","
                + "\"address\":\"南京市栖霞区迈皋桥创业园科技研发基地寅春路18号-F52\",\"branchBankName\":\"招商银行股份有限公司南京新街口支行\","
                + "\"account\":\"125910052610902\"},{\"name\":\"北京上古开天科技有限公司\","
                + "\"paytaxNumber\":\"91110108MA01K55W4R\",\"phone\":\"010-53952609\","
                + "\"address\":\"北京市海淀区上地西路6号1幢1层101D1-12\",\"branchBankName\":\"招商银行北京清华园支行\","
                + "\"account\":\"110938309710601\"},{\"name\":\"淮安康祥福文化传播有限公司\","
                + "\"paytaxNumber\":\"91320829MA1N9QGCXG\",\"phone\":\"0517-89337066\","
                + "\"address\":\"淮安市洪泽区高良涧街道渤海北路3号A06\",\"branchBankName\":\"中国建设银行淮安洪泽县支行\","
                + "\"account\":\"32050172793600000395\"}],\"code\":null,\"message\":null,\"success\":true}";

        JSONObject obj = JSON.parseObject(str);
        JSONArray result = obj.getJSONArray("result");
        Set<String> set = new HashSet<>();
        result.forEach(item -> {
            set.add(JSON.parseObject(item.toString()).getString("name"));
        });
        System.out.println(set.size());
    }
}
